Problem_1/solution/ofoam/system/controlDict
FoamFile{
	format ascii;
	class dictionary;
	object controlDict;
}

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.00002;

adjustTimeStep	no;

maxCo			0.4;

maxDeltaT		0.05;

writeControl    runTime;

writeInterval   0.005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions{
	#includeFunc CourantNo
}
