Problem_1/solution/ofoam/system/blockMeshDict
FoamFile{
	format ascii;
	class dictionary;
	object blockMeshDict;
}

vertices (
	(0     0  0)
	(5.196 0 -1)
	(5.196 1 -1)
	(0     1  0)
	(0     0  1)
	(5.196 0  2)
	(5.196 1  2)
	(0     1  1)
	(-3    0  0)
	(-3    0  1)
	(-3    1  1)
	(-3    1  0)
);

blocks (
	hex (0 1 2 3 4 5 6 7) (120 1 60) simpleGrading (120 1 60)
	hex (8 0 3 11 9 4 7 10) (90 1 60) simpleGrading (-120 1 60)
);

boundary (
	inlet{
		type patch;
		faces (
			(8 9 10 11)
		);
	}
	outlet{
		type patch;
		faces (
			(2 6 5 1)
		);
	}
	top{
		type patch;
		faces (
			(5 6 7 4)
		);
	}
	topStartup{
		type patch;
		faces (
			(4 7 10 9)
		);
	}
	bottom{
		type wall;
		faces (
			(2 1 0 3)
		);
	}
	bottomStartup{
		type patch;
		faces (
			(3 0 8 11)	
		);
	}
	walls{
		type empty;
		faces (
			(1 5 4 0)
			(3 7 6 2)
			(8 0 4 9)
			(11 10 7 3)
		);
	}
);