Problem_1/solution/ofoam/constant/turbulenceProperties
FoamFile{
	format ascii;
	class dictionary;
	object transportProperties;
}

simulationType laminar;
// simulationType RAS;

// RAS{
// 	RASModel kOmegaSST;
// 	turbulence on;
// 	printCoeffs on;
// }