Problem_1/solution/ofoam/constant/transportProperties
FoamFile{
	format ascii;
	class dictionary;
	object transportProperties;
}

transportModel Newtonian;

// nu 17.2e-6;
nu 0.01;
