Problem_1/solution/ofoam/0/U
FoamFile{
	format ascii;
	class volVectorField;
	object U;
}

dimensions [0 1 -1 0 0 0 0];

internalField uniform (30 0 -17.32);
// internalField uniform (30 0 0);

boundaryField{
	bottom{
		type noSlip;
	}
	bottomStartup{
		type zeroGradient;
	}
	inlet{
		type fixedValue;
		value uniform (30 0 0);
	}
	outlet{
		type zeroGradient;
	}
	top{
		type zeroGradient;
	}
	topStartup{
		type zeroGradient;
	}
	walls{
		type empty;
	}
}