Problem_1/solution/ofoam/0/T
FoamFile{
	format ascii;
	class volScalarField;
	object T;
}

dimensions [0 0 0 1 0 0 0];

internalField uniform 300;

boundaryField{
	".*"{
		type calculated;
		value $internalField;
	}
	walls{
		type empty;
	}
}