Problem_1/solution/ofoam/system/fvSchemes
FoamFile{
	format ascii;
	class dictionary;
	object fvSchemes;
}

ddtSchemes{
	default		CrankNicolson 0.9;
	// default steadyState;
}

gradSchemes{
	default		Gauss linear;
	grad(p)		Gauss linear;
}

divSchemes{
	default		none;
	div(phi,U)	Gauss linear;
	// div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes{
	default		Gauss linear orthogonal;
	// default		Gauss linear corrected;
}

interpolationSchemes{
	default		linear;
}

snGradSchemes{
	default		orthogonal;
	// default		corrected;
}

// wallDist{
// 	method		meshWave;
// }