Problem_1/solution/ofoam/system/fvSolution
FoamFile{
	format ascii;
	class dictionary;
	object fvSolution;
}

solvers{
	// "(p|rho)"{
	// 	solver PCG;
	// 	preconditioner DIC;
	// 	tolerance 1e-9;
	// 	relTol 0.01;
	// 	minIter 1;
	// }
	// "(p|rho)Final"{
	// 	$p;
	// 	relTol 0;
	// }
	// "(U|e|h)"{
	// 	solver smoothSolver;
	// 	smoother symGaussSeidel;
	// 	tolerance 1e-9;
	// 	relTol 0.01;
	// }
	// "(U|e|h)Final"{
	// 	$U;
	// 	relTol 0;
	// }

	p{
		solver			PCG;
		preconditioner	DIC;
		tolerance		1e-3;
		relTol			0.05;
	}

	pFinal{
		$p;
		relTol			0;
	}

	U{
		solver			smoothSolver;
		smoother		symGaussSeidel;
		tolerance		1e-3;
		relTol			0;
	}

	// UFinal{
	// 	$U;
	// 	relTol 0;
	// }

	
	// p{
	// 	solver GAMG;
	// 	tolerance 1e-10;
	// 	relTol 0.1;
	// 	smoother DICGaussSeidel;
	// }
	// "(U|k|epsilon|omega)"{
	// 	solver smoothSolver;
	// 	smoother symGaussSeidel;
	// 	tolerance 1e-10;
	// 	relTol 0.1;
	// }
}

// SIMPLE{
// 	nNonOrthogonalCorrectors 0;
// 	consistent yes;
// 	residualControl{
// 		p 1e-4;
// 		U 1e-6;
// 	}
// }

// PIMPLE{
// 	momentumPredictor yes;
// 	nOuterCorrectors 1;
// 	nCorrectors 2;
// 	nNonOrthogonalCorrectors 0;
// }

PISO{
	nCorrectors 2;
	nNonOrthogonalCorrectors 0;
	pRefCell 0;
	pRefValue 0;
}